app/controllers/articles_controller.rb

INSERT INTO "articles" ("title", "text", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["title", "hello"], ["text", "does this even work?\r\n"], ["created_at", "2015-12-21 20:41:46.940214"], ["updated_at", "2015-12-21 20:41:46.940214"]]
---
  def create
    @article=Article.new(articles_params)

    if @article.save